#+title: UAV repülés tervezése
#+date: 2023. július 6.
#+author: Kalicz Péter
#+email: kalicz.peter@uni-sopron.hu
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:nil tasks:nil tex:t
#+options: timestamp:nil title:t toc:nil todo:t |:t
#+latex_class: article
#+latex_class_options: [a4paper]
#+latex_header: \usepackage[margin=1in]{geometry}
#+latex_header: \usepackage{indentfirst}
#+latex_header: \usepackage[english,hungarian]{babel}
#+latex_header: \frenchspacing
#+latex_header_extra:
#+description:
#+keywords:
#+subtitle:
#+latex_compiler: pdflatex
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.3)

Feladatomban az alább megadott paraméterekkel rendelkező repülés
végrehajtásához a tanszéken is rendelkezésre álló DJI Mavic Enterprise
családba tartozó /DJI Mavic 3M UAV/-t választottam.
A kiválasztott drónnal egy 1200 \cdot 600 m-es területet (lásd az [[fig:teroutline]]. ábrát) mérünk fel úgy, hogy
a képek terepi felbontása 2 cm;
a képek között átfedés ($p$) 85%-os;
a sorok közötti átfedés ($q$) 55%-os legyen.
A feladat végrehajtását a feladatkiírásnak megfelelően részletezem.

#+CAPTION[Vázlat]: A térképezendő terület vázlata
#+NAME:   fig:teroutline
[[file:simpleter.pdf]]


** R-kód a kamera paramétereihez                                   :noexport:
#+begin_src R
  ## Egyenértékű fókusztávolság
  c_35 <- 24
  ## A 35 mm film átlója
  s_35_atlo <- sqrt( 36 ^2 + 24^2)

#+end_src

#+RESULTS:
: 20



